Revit 2027 API
FamilyManager.ReplaceParameter(FamilyParameter, String, ForgeTypeId, Boolean) Method
Replace a shared family parameter with a new non-shared family parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyParameter ReplaceParameter(
	FamilyParameter currentParameter,
	string parameterName,
	ForgeTypeId groupTypeId,
	bool isInstance
)
Public Function ReplaceParameter (
	currentParameter As FamilyParameter,
	parameterName As String,
	groupTypeId As ForgeTypeId,
	isInstance As Boolean
) As FamilyParameter
public:
FamilyParameter^ ReplaceParameter(
	FamilyParameter^ currentParameter,
	String^ parameterName,
	ForgeTypeId^ groupTypeId,
	bool isInstance
)
member ReplaceParameter :
        currentParameter : FamilyParameter *
        parameterName : string *
        groupTypeId : ForgeTypeId *
        isInstance : bool -> FamilyParameter
Parameters
currentParameter FamilyParameter
The current family parameter.
parameterName String
The name of the new family parameter.
groupTypeId ForgeTypeId
The identifier of the group to which the new family parameter belongs.
isInstance Boolean
Indicates if the new parameter is instance or type.
Return Value
FamilyParameter
If replacement was successful the new family parameter is returned, otherwise an exception with failure information will be thrown.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"currentParameter" or "parameterName"-is null.
ArgumentException |  Thrown when the input argument-"currentParameter"-is invalid, or the input parameter group cannot be assigned to the new parameter, or the input name string contains illegal characters, or duplicated with existing parameter name.
InvalidOperationException |  Thrown when trying to replace a built-in parameter or family parameter.
InvalidOperationException |  Thrown when replacement failed, because the replacement would cause a formula error. Or trying to replace with an instance parameter of image type.
See Also
Reference
FamilyManager Class
ReplaceParameter Overload
Autodesk.Revit.DB Namespace